lyzh-liyao/Cube_Project/STM32_Liyao_Frame/Frame/ComBuff.c
#if UART1_IT_RECEIVER || UART1_DMA_RECEIVER
	WRITE_REG(USART1->ICR, UART_CLEAR_IDLEF);
	SET_BIT(USART1->CR1, USART_ISR_IDLE);
#endif
#if UART2_IT_RECEIVER || UART2_DMA_RECEIVER
	WRITE_REG(USART2->ICR, UART_CLEAR_IDLEF);
	SET_BIT(USART2->CR1, USART_ISR_IDLE);
#endif
#if UART3_IT_RECEIVER || UART3_DMA_RECEIVER
	WRITE_REG(USART3->ICR, UART_CLEAR_IDLEF);
	SET_BIT(USART3->CR1, USART_ISR_IDLE);
#endif
#if UART4_IT_RECEIVER || UART4_DMA_RECEIVER
	WRITE_REG(USART4->ICR, UART_CLEAR_IDLEF);
	SET_BIT(USART4->CR1, USART_ISR_IDLE);
#endif
#if UART5_IT_RECEIVER || UART5_DMA_RECEIVER
	WRITE_REG(USART5->ICR, UART_CLEAR_IDLEF);
	SET_BIT(USART5->CR1, USART_ISR_IDLE);
#endif


#ifdef __TASKTIMEMANAGER_H__
	/*-----------持续传输任务-----------------*/
//  TaskTime_Add(TaskID++, TimeCycle(0,10), SenderKeepTransmit, Real_Mode);
	/*-----------协议解析任务-----------------*/
//  TaskTime_Add(TaskID++, TimeCycle(0,10), PaddingProtocol, Real_Mode);
#endif
}
//--------------------------------printf实现-------------------------------------
/*
void printch(char ch);
void printdec(int dec);
void printflt(double flt);
void printstr(char* str);
void printbin(int bin);
void printhex(int hex);
void StringFormat(char* target, uint8_t type,const char* fmt,va_list vp);

void printch(char ch)
{
#ifdef LL_LIB
		LL_USART_TransmitData8(DEBUG_USART,ch);
#else
	while(HAL_UART_Transmit(&DEBUG_USART, (uint8_t*)&ch, 1, 100) == HAL_BUSY);
#endif
}

void mvprintf(const char* fmt,va_list vp){
	StringFormat(NULL, 0, fmt, vp);
}

void msprintf(char* target,const char* fmt,va_list vp){
	StringFormat(target, 1, fmt, vp);
}

void mprintf(const char* fmt, ...)
{
    va_list vp;
    va_start(vp, fmt);
		mvprintf(fmt, vp);
    va_end(vp);
}

void StringFormat(char* target,uint8_t type,const char* fmt,va_list vp){
	double vargflt = 0;
    int  vargint = 0;
    char* vargpch = NULL;
    char vargch = 0;
    const char* pfmt = NULL;
    pfmt = fmt;

    while(*pfmt)
    {
        if(*pfmt == '%')
        {
            switch(*(++pfmt))
            {
                
                case 'c':
                    printch(vargch);
                    break;
                case 'd':
                case 'i':
                    vargint = va_arg(vp, int);
                    printdec(vargint);
                    break;
                case 'f':
                    vargflt = va_arg(vp, double);
                    printflt(vargflt);
                    break;
                case 's':
                    vargpch = va_arg(vp, char*);
                    printstr(vargpch);
                    break;
                case 'b':
                case 'B':
                    vargint = va_arg(vp, int);
                    printbin(vargint);
                    break;
                case 'x':
                case 'X':
                    vargint = va_arg(vp, int);
                    printhex(vargint);
                    break;
                case '%':
                    printch('%');
                    break;
                default:
                    break;
            }
            pfmt++;
        }
        else
        {
						if(type == 0)
							printch(*pfmt++);
						else if(type == 1)
							*target++ = *pfmt++;
        }
    }
}


void printdec(int dec)
{
	char buff[20] = {0};
	int8_t i = 0;
	int num = dec;
	do{
		num /= 10;
		i++;
	}while(num != 0);
	
	if(dec < 0){
		buff[0] = '-';
		i++;
	}
	while(--i >= 0){
		buff[i] = dec%10 + '0';
		dec /= 10;
	}
	printstr(buff);
}

void printflt(double flt)
{
    int tmpint = 0;
    tmpint = (int)flt;
    printdec(tmpint);
    printch('.');
    flt = flt - tmpint;
    tmpint = (int)(flt * 1000000);
    printdec(tmpint);
}

void printstr(char* str)
{
    while(*str)
    {
        printch(*str++);
    }
}

void printbin(int bin)
{
    if(bin == 0)
    {
        printstr("0b");
        return;
    }
    printbin(bin/2);
    printch( (char)(bin%2 + '0'));
}

void printhex(int hex)
{
    if(hex==0)
    {
        printstr("0x");
        return;
    }
    printhex(hex/16);
    if(hex < 10)
    {
        printch((char)(hex%16 + '0'));
    }
    else
    {
        printch((char)(hex%16 - 10 + 'a' ));
    }
}
*/

